/* ============================================================

   GROUP 9 Final Project : ตู้หยอดเหรียญ
   51423364 การเขียนโปรแกรมสำหรับระบบสมองกลฝังตัว

    1	นายชิษณุพงศ์ วิเชียรกุล	68050200	
    2	นายกิตติภน ภาษีชา	68050392	
    3	นายณัชพล วงศ์ยัง	68050393	
    4	นายธีรธน จันทบุตร	68050395	


   ============================================================ */
#include "PROJECT_G9.h"


void setup()
{
    Serial.begin(115200);
    Serial.printf("\n=== GROUP 9 Final Project : ตู้หยอดเหรียญ ===\n");
    code_ProjectG9_setup();  
}

void loop()
{
    code_ProjectG9_loop();
}