/* ============================================================

   GROUP 9 Final Project : ตู้หยอดเหรียญ
   51423364 การเขียนโปรแกรมสำหรับระบบสมองกลฝังตัว

    1	นายชิษณุพงศ์ วิเชียรกุล	68050200	
    2	นายกิตติภน ภาษีชา	68050392	
    3	นายณัชพล วงศ์ยัง	68050393	
    4	นายธีรธน จันทบุตร	68050395	

   ------------------------------------------------------------
   1. แก้ GROUP_NO ใน lab13.h เป็นเลขกลุ่ม
   2. เปลี่ยนเลข STEP แล้ว Upload  ทำตามลำดับ 0 → 1 → 2 → 3 (→ 4 ส่วนเพิ่มเติม)
   3. ก่อน Upload ทุกครั้ง เขียนคำทายลงใบงานก่อน
   Serial Monitor 115200  (STEP 1 คลิกในหน้าต่าง Monitor แล้วพิมพ์ กด Enter)
   ============================================================ */
#include "PROJECT_G9.h"


void setup()
{
    Serial.begin(115200);
    delay(200);
    Serial.printf("\n=== GROUP 9 Final Project : ตู้หยอดเหรียญ ===\n");
    code_ProjectG9_setup();  
}

void loop()
{
    code_ProjectG9_loop();
}